org/CPSC110/Module-1.org
#+TITLE: Module 1
#+SETUPFILE: ../template-1.org
Created on 2020-07-12/14:082

* Learning Goals
+ Understand systematic design process.
+ Understand that programs are written both to run and to read.
+ Understand relation between information and data.
+ Understand that the structure of the data a program operates on determines many elements of the program's structure.
+ Understand that one can replace repetitive code with an abstraction in a systematic way.
  + This is the heart of designing libraries.
+ Understand that programs can be described using notations other than code, and these models facilitate program design.


* Beginning Student Language
** Expressions
+ Simple arithmatic
  + src_racket{(+ 3 4)} => 7
    + In this case, src_racket{(+ 3 4)} is the expression, and =7= is the value.


+ Racket works by parsing expressions to produce values.
  + src_racket{(+ 3 (* 2 3))} => 9
  + src_racket{(/ 12 (* 2 3))} => 2


+ To from an expression, start with src_racket{(<primitive> <expression>)} or simly a =<value>=.
  + =;= can be used to comment out lines.

+ src_racket{(sqr 3)} => 9
+ src_racket{(sqrt 16)} => 4



*** Evaluating simple expressions
+ How are the expressions evaluated by racket?


+ src_racket{(+ 2 (* 3 4) (- (+ 1 2) 3))} => 14

+ This expression starts with an open bracket, then a primitive operation, thus, it's called a *primitive call*, or a *call to a primitive*.
  + Within this primitive call, the =+= is the *operator.*
  + The expressions following the operator are known as *operands.*
    + An operand can also have its own operator and operands.


------
+ *To evaluate a primitive call*          src_racket{(+ 2 (* 3 4) (- (+ 1 2) 3))}
  1. First, the operands are reduced to values.
     + The first operand, =2= is already reduced to a value.
     + The second operand is still an expression. This primitive call: src_racket{(* 3 4)} needs to be reduced to =12=.

     + The expression now looks like this: src_racket{(+ 2 12    (- (+ 1 2) 3))}

     + The third operand, or expression still needs to be reduced.
       + Within this operand, the first operand is not a value, and needs to be reduced.
         + src_racket{(+ 1 2)} will become 3.

       + Now, the evaluation looks like this: src_racket{(+ 2 12 (- 3 3))}.

       + The src_racket{(- 3 3)} will reduce to =0=.

     + Now, the expression looks like this: src_racket{(+ 2 12 0)}

  2. Then, the primitive is applied to all values.
     src_racket{(+ 2 12 0)} => 14


+ Intuitively, expressions are evaluated from left to right, and inside to outside.
------
