CPSC110/Module-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Module 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Mao" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Module 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a54410">Learning Goals</a></li>
<li><a href="#orgfd8a9af">Beginning Student Language</a>
<ul>
<li><a href="#orgcb174b4">Expressions</a>
<ul>
<li><a href="#orgd5ff08f">Evaluating simple expressions</a></li>
<li><a href="#org00ebd8d">Terminology</a></li>
</ul>
</li>
<li><a href="#org4b048c2">Strings and images</a>
<ul>
<li><a href="#org5d16e89">String primitives</a></li>
<li><a href="#org50d9530">Image primitives</a></li>
</ul>
</li>
<li><a href="#orge08c65a">Constant definitions</a>
<ul>
<li><a href="#org306cf3e">Evaluating constant definitions</a></li>
</ul>
</li>
<li><a href="#orgf2b8822">Function definitions</a>
<ul>
<li><a href="#org118ce79">Evaluating functions</a></li>
</ul>
</li>
<li><a href="#orgdbf86fc"><span class="todo TODO">TODO</span> Booleans and if expressions</a></li>
<li><a href="#org556f8b5"><span class="todo TODO">TODO</span> Using the stepper</a></li>
<li><a href="#org48e2792"><span class="todo TODO">TODO</span> Discovering primitives</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Created on 2020-07-12/14:082
</p>

<div id="outline-container-org6a54410" class="outline-2">
<h2 id="org6a54410">Learning Goals</h2>
<div class="outline-text-2" id="text-org6a54410">
<ul class="org-ul">
<li>Understand systematic design process.</li>
<li>Understand that programs are written both to run and to read.</li>
<li>Understand relation between information and data.</li>
<li>Understand that the structure of the data a program operates on determines many elements of the program's structure.</li>
<li>Understand that one can replace repetitive code with an abstraction in a systematic way.
<ul class="org-ul">
<li>This is the heart of designing libraries.</li>
</ul></li>
<li>Understand that programs can be described using notations other than code, and these models facilitate program design.</li>
</ul>
</div>
</div>


<div id="outline-container-orgfd8a9af" class="outline-2">
<h2 id="orgfd8a9af">Beginning Student Language</h2>
<div class="outline-text-2" id="text-orgfd8a9af">
</div>
<div id="outline-container-orgcb174b4" class="outline-3">
<h3 id="orgcb174b4">Expressions</h3>
<div class="outline-text-3" id="text-orgcb174b4">
<ul class="org-ul">
<li>Simple arithmatic
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #AB9DF2;">)</span></code> =&gt; 7
<ul class="org-ul">
<li>In this case, <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #AB9DF2;">)</span></code> is the expression, and <code>7</code> is the value.</li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Racket works by parsing expressions to produce values.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code> =&gt; 9</li>
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">/</span> <span style="color: #AB9DF2; font-weight: bold;">12</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code> =&gt; 2</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>To from an expression, start with <code class="src src-racket"><span style="color: #AB9DF2;">(</span>&lt;primitive&gt; &lt;expression&gt;<span style="color: #AB9DF2;">)</span></code> or simly a <code>&lt;value&gt;</code>.
<ul class="org-ul">
<li><code>;</code> can be used to comment out lines.</li>
</ul></li>

<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">sqr</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #AB9DF2;">)</span></code> =&gt; 9</li>
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">sqrt</span> <span style="color: #AB9DF2; font-weight: bold;">16</span><span style="color: #AB9DF2;">)</span></code> =&gt; 4</li>
</ul>
</div>



<div id="outline-container-orgd5ff08f" class="outline-4">
<h4 id="orgd5ff08f">Evaluating simple expressions</h4>
<div class="outline-text-4" id="text-orgd5ff08f">
<ul class="org-ul">
<li>How are the expressions evaluated by racket?</li>
</ul>


<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #78DCE8;">)</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">-</span> <span style="color: #FC9867;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #AB9DF2; font-weight: bold;">2</span><span style="color: #FC9867;">)</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code> =&gt; 14</li>

<li>This expression starts with an open bracket, then a primitive operation, thus, it's called a <b>primitive call</b>, or a <b>call to a primitive</b>.
<ul class="org-ul">
<li>Within this primitive call, the <code>+</code> is the <b>operator.</b></li>
<li>The expressions following the operator are known as <b>operands.</b>
<ul class="org-ul">
<li>An operand can also have its own operator and operands.</li>
</ul></li>
</ul></li>
</ul>


<hr />
<ul class="org-ul">
<li><b>To evaluate a primitive call</b>          <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #78DCE8;">)</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">-</span> <span style="color: #FC9867;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #AB9DF2; font-weight: bold;">2</span><span style="color: #FC9867;">)</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code>
<ol class="org-ol">
<li>First, the operands are reduced to values.
<ul class="org-ul">
<li>The first operand, <code>2</code> is already reduced to a value.</li>
<li>The second operand is still an expression. This primitive call: <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #AB9DF2;">)</span></code> needs to be reduced to <code>12</code>.</li>

<li>The expression now looks like this: <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">12</span>    <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">-</span> <span style="color: #FC9867;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #AB9DF2; font-weight: bold;">2</span><span style="color: #FC9867;">)</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code></li>

<li>The third operand, or expression still needs to be reduced.
<ul class="org-ul">
<li>Within this operand, the first operand is not a value, and needs to be reduced.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #AB9DF2; font-weight: bold;">2</span><span style="color: #AB9DF2;">)</span></code> will become 3.</li>
</ul></li>

<li>Now, the evaluation looks like this: <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">12</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">-</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code>.</li>

<li>The <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">-</span> <span style="color: #AB9DF2; font-weight: bold;">3</span> <span style="color: #AB9DF2; font-weight: bold;">3</span><span style="color: #AB9DF2;">)</span></code> will reduce to <code>0</code>.</li>
</ul></li>

<li>Now, the expression looks like this: <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">12</span> <span style="color: #AB9DF2; font-weight: bold;">0</span><span style="color: #AB9DF2;">)</span></code></li>
</ul></li>

<li>Then, the primitive is applied to all values.
<code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">12</span> <span style="color: #AB9DF2; font-weight: bold;">0</span><span style="color: #AB9DF2;">)</span></code> =&gt; 14</li>
</ol></li>
</ul>


<ul class="org-ul">
<li>Intuitively, expressions are evaluated from left to right, and inside to outside.</li>
</ul>
<hr />
</div>
</div>
