org/CPSC110/Module-1.org
*** Terminology
+ Expression
  + Element that is evaluated to produce a value.
+ Value
  + Data element such as 1, "foo", (make-cat 10 20).
+ Evaluate
  + In Basic Student Language, the program executes by evaluating expressions and producing values.
+ Operator
  + Primitive operators operate and manipulate primitive data.
+ Primitive
  + Basic building block provided by BSL which is used to design programs.
+ Operand
  + Expressions following function name in a *function call expression* or the operator name in a *primitive call expression.*
+ Argument
  + Value passed to a function or primitive operation when called.
+ Number
  + Primitive type of data representing any number.

** Strings and images
+ Strings represent words and names.
+ Images help to build up pictures.


+ Calls to string and image primitives work just like calls to number primitives.


*** String primitives
+ Strings look like this: src_racket{"apple"}
+ Running:
#+BEGIN_SRC racket
"apple"
"Ada"
#+END_SRC
    =>
#+BEGIN_SRC racket
"apple"
"Ada"
#+END_SRC
+ You can put strings together by using =string-append=.
  + src_racket{(string-append "Ada" " " "Lovelace")} => "Ada Lovelace"


+ It is important to differentiate strings and values.
  + src_racket{"123"} is a string.
  + src_racket{123} is a number.
+ It is possible to add a number to the value, but you cannot add 1 to a string.
 #+BEGIN_SRC racket
(+ 1 "123")
(+ 1 123)
#+END_SRC
==> +: expects a number as 2nd argument, given "123"=


+ Another string primitive is src_racket{(string-length)}
  + src_racket{(string-length)} will return the number of characters your given string is.

    

+ Using the src_racket{(substring)} primitive, you can remove characters using indexes.
  + src_racket{(substring "Caribou" 2 4)} will remove all characters from indexes 2 to 4.
    + => ="ri"=


  + =substring= works off of 0-based indexing. The index starts at 0, and will stop just before the final stated index.
    + src_racket{(substring "012345678" 2 4)} => "23"



*** Image primitives
+ For this specific lecture, you must tell DrRacket to use the image functions from the 2nd edition of the How to Design Programs book.
  + To do this, include src_racket{(require 2htdp/image)} at the start of the racket file.


+ src_racket{(circle 10 "solid" "red")}
  + This will produce a red, solid circle with a radius of 10 pixels.
+ src_racket{(rectangle 30 60 "outline" "blue")}
  + This will create a 30x60 pixel blue rectangle outline.
+ src_racket{(text "hello" 24 "orange")}
  + This will create an image showing "hello", with font-size 24, orange.


#+BEGIN_SRC racket
(above (circle 10 "solid" "red")
       (circle 20 "solid" "yellow")
       (circle 30 "solid" "green"))
#+END_SRC
+ This will create three circles, each stacked ontop of each other.


  #+BEGIN_SRC racket
(beside (circle 10 "solid" "red")
        (circle 20 "solid" "yellow")
        (circle 30 "solid" "green"))
#+END_SRC
+ This will create three circles, each beside each other.

#+BEGIN_SRC racket
(overlay (circle 10 "solid" "red")
         (circle 20 "solid" "yellow")
         (circle 30 "solid" "green"))
#+END_SRC
+ This will create three circles, stacked ontop of each other.


