CPSC110/Module-1.html
<div id="outline-container-org00ebd8d" class="outline-4">
<h4 id="org00ebd8d">Terminology</h4>
<div class="outline-text-4" id="text-org00ebd8d">
<ul class="org-ul">
<li>Expression
<ul class="org-ul">
<li>Element that is evaluated to produce a value.</li>
</ul></li>
<li>Value
<ul class="org-ul">
<li>Data element such as 1, "foo", (make-cat 10 20).</li>
</ul></li>
<li>Evaluate
<ul class="org-ul">
<li>In Basic Student Language, the program executes by evaluating expressions and producing values.</li>
</ul></li>
<li>Operator
<ul class="org-ul">
<li>Primitive operators operate and manipulate primitive data.</li>
</ul></li>
<li>Primitive
<ul class="org-ul">
<li>Basic building block provided by BSL which is used to design programs.</li>
</ul></li>
<li>Operand
<ul class="org-ul">
<li>Expressions following function name in a <b>function call expression</b> or the operator name in a <b>primitive call expression.</b></li>
</ul></li>
<li>Argument
<ul class="org-ul">
<li>Value passed to a function or primitive operation when called.</li>
</ul></li>
<li>Number
<ul class="org-ul">
<li>Primitive type of data representing any number.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4b048c2" class="outline-3">
<h3 id="org4b048c2">Strings and images</h3>
<div class="outline-text-3" id="text-org4b048c2">
<ul class="org-ul">
<li>Strings represent words and names.</li>
<li>Images help to build up pictures.</li>
</ul>


<ul class="org-ul">
<li>Calls to string and image primitives work just like calls to number primitives.</li>
</ul>
</div>


<div id="outline-container-org5d16e89" class="outline-4">
<h4 id="org5d16e89">String primitives</h4>
<div class="outline-text-4" id="text-org5d16e89">
<ul class="org-ul">
<li>Strings look like this: <code class="src src-racket"><span style="color: #FFD866;">"apple"</span></code></li>
<li>Running:</li>
</ul>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #FFD866;">"apple"</span>
<span style="color: #FFD866;">"Ada"</span>
</pre>
</div>
<p>
=&gt;
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #FFD866;">"apple"</span>
<span style="color: #FFD866;">"Ada"</span>
</pre>
</div>
<ul class="org-ul">
<li>You can put strings together by using <code>string-append</code>.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">string-append</span> <span style="color: #FFD866;">"Ada"</span> <span style="color: #FFD866;">" "</span> <span style="color: #FFD866;">"Lovelace"</span><span style="color: #AB9DF2;">)</span></code> =&gt; "Ada Lovelace"</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>It is important to differentiate strings and values.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #FFD866;">"123"</span></code> is a string.</li>
<li><code class="src src-racket"><span style="color: #AB9DF2; font-weight: bold;">123</span></code> is a number.</li>
</ul></li>
<li><p>
It is possible to add a number to the value, but you cannot add 1 to a string.
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #FFD866;">"123"</span><span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">+</span> <span style="color: #AB9DF2; font-weight: bold;">1</span> <span style="color: #AB9DF2; font-weight: bold;">123</span><span style="color: #AB9DF2;">)</span>
</pre>
</div></li>
</ul>
<p>
<code>=&gt; +: expects a number as 2nd argument, given "123"</code>
</p>


<ul class="org-ul">
<li>Another string primitive is <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">string-length</span><span style="color: #AB9DF2;">)</span></code>
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">string-length</span><span style="color: #AB9DF2;">)</span></code> will return the number of characters your given string is.</li>
</ul></li>
</ul>



<ul class="org-ul">
<li>Using the <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">substring</span><span style="color: #AB9DF2;">)</span></code> primitive, you can remove characters using indexes.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">substring</span> <span style="color: #FFD866;">"Caribou"</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #AB9DF2;">)</span></code> will remove all characters from indexes 2 to 4.
<ul class="org-ul">
<li><code>&gt; ="ri"</code></li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li><code>substring</code> works off of 0-based indexing. The index starts at 0, and will stop just before the final stated index.
<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">substring</span> <span style="color: #FFD866;">"012345678"</span> <span style="color: #AB9DF2; font-weight: bold;">2</span> <span style="color: #AB9DF2; font-weight: bold;">4</span><span style="color: #AB9DF2;">)</span></code> =&gt; "23"</li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-org50d9530" class="outline-4">
<h4 id="org50d9530">Image primitives</h4>
<div class="outline-text-4" id="text-org50d9530">
<ul class="org-ul">
<li>For this specific lecture, you must tell DrRacket to use the image functions from the 2nd edition of the How to Design Programs book.
<ul class="org-ul">
<li>To do this, include <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">require</span> 2htdp/image<span style="color: #AB9DF2;">)</span></code> at the start of the racket file.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">10</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #AB9DF2;">)</span></code>
<ul class="org-ul">
<li>This will produce a red, solid circle with a radius of 10 pixels.</li>
</ul></li>
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span>rectangle <span style="color: #AB9DF2; font-weight: bold;">30</span> <span style="color: #AB9DF2; font-weight: bold;">60</span> <span style="color: #FFD866;">"outline"</span> <span style="color: #FFD866;">"blue"</span><span style="color: #AB9DF2;">)</span></code>
<ul class="org-ul">
<li>This will create a 30x60 pixel blue rectangle outline.</li>
</ul></li>
<li><code class="src src-racket"><span style="color: #AB9DF2;">(</span>text <span style="color: #FFD866;">"hello"</span> <span style="color: #AB9DF2; font-weight: bold;">24</span> <span style="color: #FFD866;">"orange"</span><span style="color: #AB9DF2;">)</span></code>
<ul class="org-ul">
<li>This will create an image showing "hello", with font-size 24, orange.</li>
</ul></li>
</ul>


<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>above <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">10</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">20</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"yellow"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">30</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"green"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>This will create three circles, each stacked ontop of each other.</li>
</ul>


<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>beside <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">10</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #78DCE8;">)</span>
        <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">20</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"yellow"</span><span style="color: #78DCE8;">)</span>
        <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">30</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"green"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>This will create three circles, each beside each other.</li>
</ul>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>overlay <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">10</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #78DCE8;">)</span>
         <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">20</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"yellow"</span><span style="color: #78DCE8;">)</span>
         <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">30</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"green"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>This will create three circles, stacked ontop of each other.</li>
</ul>
</div>
</div>
</div>
