org/CPSC110/Module-1.org
** Constant definitions
+ Constant definitions greatly improve readability and changeability.

+ Constants are named values defined using src_racket{define} and never changes.

+ Constant definitions give name to a value used in another part of the program.

#+BEGIN_SRC racket
(define WIDTH 400)
(define HEIGHT 600)
#+END_SRC

+ These are two named constants define the width and height of an imaginary web game.

+ It is important to note that defining a constant does *not* produce a value.

#+BEGIN_SRC racket
(* WIDTH HEIGHT)
#+END_SRC

+ We can evaluate this and DrRacket will replace the name of a defined constant with its value.
  + The expression above is equivalent to src_racket{(* 400 600)}=> 240000


+ To form a constant definition, src_racket{(define <name> <expression>)}.

------
*** Evaluating constant definitions
  1. When racket encounters the constant definition, it will evaluate the expression and uses the resulting value as the value of the constant with the given name.
  2. When encountering a defined constant name, it will evaluate that value as the value that the =define= associated it with.


------
+ You can also define images.
#+BEGIN_SRC racket
(define CAT /image/cat.png/)
#+END_SRC
+ In this example, the name constant can be defined directly by an image.
  + Thus, you can use expressions to manipulate the image.
    + For example, src_racket{(rotate -10 CAT)}. This expression will rotate the cat by -10 degrees.


+ You can also add expressions after the constant name.
  + For example, src_racket{(define RCAT (rotate -19 CAT))}


+ A constant name can only be defined once.


** Function definitions
+ Functions contain a name and one or more parameters. A function will also have a body, which is an expression that is evaluated to produce the resulting value of the function.
+ Functions will allow a program to produce a different value each time they run.

  #+BEGIN_SRC racket
(above (circle 40 "solid" "red")
       (circle 40 "solid" "yellow")
       (circle 40 "solid" "green"))
  #+END_SRC
  + This code has a lot of redundency as only the colour is changing in each call to circle.
  + Using functions, this redundency can be removed.


+ Within a function, the parameter is the varying value.
#+BEGIN_SRC racket
(define (bulb c)
  (circle 40 "solid" c)
#+END_SRC
+ In this case, the changing value, =c= can be used to call =circle= with varying parameters.


+ The beginning example function can therefore be rewritten as:
#+BEGIN_SRC racket
(above (bulb "red")
       (bulb "yellow")
       (bulb "green"))
#+END_SRC


*** Evaluating functions
+ To form a function definition:
  #+BEGIN_SRC racket
(define (<name> <name of parameter>)
  <expression>)

(define (bulb c)
  (circle 40 "solid" c))
  #+END_SRC



+ To form a function call expression:
  #+BEGIN_SRC racket
(<name of defined function> <expression>)

(bulb (string-append "re" "d"))
  #+END_SRC
------
+ *To evaluate a function call* src_racket{(bulb (string-append "re" "d"))}
  1. First, reduce operands to values, also known as *arguments.*
     + The first operand src_racket{(string-append)} is a primitive call, and will follow [[Evaluating simple expressions][primitive call rules.]]
     + Since ="re"= and ="d"= are already values, the primitive src_racket{(string-append)} will be applied.
     + The expression now looks like this: src_racket{(bulb "r .ed")}
  2. Now all operands are values, the function call will be replaced by the body of the function, and all parameters will be replaced by the argument.
     + The expression now looks like this src_racket{(circle 40 "solid" "red")}
     + After the function call is replaced, the final experssion is a simple primitive call which is evaluated using primitive call rules.

------

** Booleans and if expressions
+ A boolean represents the answer to true or false questions.
+ There are two booleans in BSL.
#+BEGIN_SRC racket :lang racket :session
true
false
#+END_SRC
+ for example:

 
  #+BEGIN_SRC racket
(define WIDTH 100)
(define HEIGHT 100)

(> WIDTH HEIGHT)
  #+END_SRC

  : RESULTS:
  : #f


** TODO Using the stepper
** TODO Discovering primitives

