CPSC110/Module-1.html


<div id="outline-container-orge08c65a" class="outline-3">
<h3 id="orge08c65a">Constant definitions</h3>
<div class="outline-text-3" id="text-orge08c65a">
<ul class="org-ul">
<li>Constant definitions greatly improve readability and changeability.</li>

<li>Constants are named values defined using <code class="src src-racket"><span style="color: #FF6188;">define</span></code> and never changes.</li>

<li>Constant definitions give name to a value used in another part of the program.</li>
</ul>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #FCFCFA;">WIDTH</span> <span style="color: #AB9DF2; font-weight: bold;">400</span><span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #FCFCFA;">HEIGHT</span> <span style="color: #AB9DF2; font-weight: bold;">600</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>These are two named constants define the width and height of an imaginary web game.</li>

<li>It is important to note that defining a constant does <b>not</b> produce a value.</li>
</ul>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">*</span> WIDTH HEIGHT<span style="color: #AB9DF2;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>We can evaluate this and DrRacket will replace the name of a defined constant with its value.
<ul class="org-ul">
<li>The expression above is equivalent to <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">*</span> <span style="color: #AB9DF2; font-weight: bold;">400</span> <span style="color: #AB9DF2; font-weight: bold;">600</span><span style="color: #AB9DF2;">)</span></code>=&gt; 240000</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>To form a constant definition, <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #FCFCFA;">&lt;name&gt;</span> &lt;expression&gt;<span style="color: #AB9DF2;">)</span></code>.</li>
</ul>

<hr />
</div>
<div id="outline-container-org306cf3e" class="outline-4">
<h4 id="org306cf3e">Evaluating constant definitions</h4>
<div class="outline-text-4" id="text-org306cf3e">
<ol class="org-ol">
<li>When racket encounters the constant definition, it will evaluate the expression and uses the resulting value as the value of the constant with the given name.</li>
<li>When encountering a defined constant name, it will evaluate that value as the value that the <code>define</code> associated it with.</li>
</ol>


<hr />
<ul class="org-ul">
<li>You can also define images.</li>
</ul>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #FCFCFA;">CAT</span> /image/cat.png/<span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>In this example, the name constant can be defined directly by an image.
<ul class="org-ul">
<li>Thus, you can use expressions to manipulate the image.
<ul class="org-ul">
<li>For example, <code class="src src-racket"><span style="color: #AB9DF2;">(</span>rotate <span style="color: #2e8b57;">-10</span> CAT<span style="color: #AB9DF2;">)</span></code>. This expression will rotate the cat by -10 degrees.</li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>You can also add expressions after the constant name.
<ul class="org-ul">
<li>For example, <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #FCFCFA;">RCAT</span> <span style="color: #78DCE8;">(</span>rotate <span style="color: #2e8b57;">-19</span> CAT<span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>A constant name can only be defined once.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgf2b8822" class="outline-3">
<h3 id="orgf2b8822">Function definitions</h3>
<div class="outline-text-3" id="text-orgf2b8822">
<ul class="org-ul">
<li>Functions contain a name and one or more parameters. A function will also have a body, which is an expression that is evaluated to produce the resulting value of the function.</li>
<li><p>
Functions will allow a program to produce a different value each time they run.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>above <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"yellow"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"green"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>This code has a lot of redundency as only the colour is changing in each call to circle.</li>
<li>Using functions, this redundency can be removed.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Within a function, the parameter is the varying value.</li>
</ul>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #78DCE8;">(</span><span style="color: #A9DC76;">bulb</span> c<span style="color: #78DCE8;">)</span>
  <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> c<span style="color: #78DCE8;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>In this case, the changing value, <code>c</code> can be used to call <code>circle</code> with varying parameters.</li>
</ul>


<ul class="org-ul">
<li>The beginning example function can therefore be rewritten as:</li>
</ul>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>above <span style="color: #78DCE8;">(</span>bulb <span style="color: #FFD866;">"red"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>bulb <span style="color: #FFD866;">"yellow"</span><span style="color: #78DCE8;">)</span>
       <span style="color: #78DCE8;">(</span>bulb <span style="color: #FFD866;">"green"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>


<div id="outline-container-org118ce79" class="outline-4">
<h4 id="org118ce79">Evaluating functions</h4>
<div class="outline-text-4" id="text-org118ce79">
<ul class="org-ul">
<li><p>
To form a function definition:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #78DCE8;">(</span><span style="color: #A9DC76;">&lt;name&gt;</span> &lt;name of parameter&gt;<span style="color: #78DCE8;">)</span>
  &lt;expression&gt;<span style="color: #AB9DF2;">)</span>

<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">define</span> <span style="color: #78DCE8;">(</span><span style="color: #A9DC76;">bulb</span> c<span style="color: #78DCE8;">)</span>
  <span style="color: #78DCE8;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> c<span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div></li>
</ul>



<ul class="org-ul">
<li><p>
To form a function call expression:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #AB9DF2;">(</span>&lt;name of defined function&gt; &lt;expression&gt;<span style="color: #AB9DF2;">)</span>

<span style="color: #AB9DF2;">(</span>bulb <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">string-append</span> <span style="color: #FFD866;">"re"</span> <span style="color: #FFD866;">"d"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div></li>
</ul>
<hr />
<ul class="org-ul">
<li><b>To evaluate a function call</b> <code class="src src-racket"><span style="color: #AB9DF2;">(</span>bulb <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">string-append</span> <span style="color: #FFD866;">"re"</span> <span style="color: #FFD866;">"d"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span></code>
<ol class="org-ol">
<li>First, reduce operands to values, also known as <b>arguments.</b>
<ul class="org-ul">
<li>The first operand <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">string-append</span><span style="color: #AB9DF2;">)</span></code> is a primitive call, and will follow <a href="#orgd5ff08f">primitive call rules.</a></li>
<li>Since <code>"re"</code> and <code>"d"</code> are already values, the primitive <code class="src src-racket"><span style="color: #AB9DF2;">(</span><span style="color: #78DCE8;">string-append</span><span style="color: #AB9DF2;">)</span></code> will be applied.</li>
<li>The expression now looks like this: <code class="src src-racket"><span style="color: #AB9DF2;">(</span>bulb <span style="color: #FFD866;">"red"</span><span style="color: #AB9DF2;">)</span></code></li>
</ul></li>
<li>Now all operands are values, the function call will be replaced by the body of the function, and all parameters will be replaced by the argument.
<ul class="org-ul">
<li>The expression now looks like this <code class="src src-racket"><span style="color: #AB9DF2;">(</span>circle <span style="color: #AB9DF2; font-weight: bold;">40</span> <span style="color: #FFD866;">"solid"</span> <span style="color: #FFD866;">"red"</span><span style="color: #AB9DF2;">)</span></code></li>
<li>After the function call is replaced, the final experssion is a simple primitive call which is evaluated using primitive call rules.</li>
</ul></li>
</ol></li>
</ul>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgdbf86fc" class="outline-3">
<h3 id="orgdbf86fc"><span class="todo TODO">TODO</span> Booleans and if expressions</h3>
</div>
<div id="outline-container-org556f8b5" class="outline-3">
<h3 id="org556f8b5"><span class="todo TODO">TODO</span> Using the stepper</h3>
</div>
<div id="outline-container-org48e2792" class="outline-3">
<h3 id="org48e2792"><span class="todo TODO">TODO</span> Discovering primitives</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Mao</p>
</div>
</body>
</html>
